---
kind: method
id: M:Autodesk.Revit.DB.ToposolidType.GetContourSetting
source: html/916e164a-0d63-6d1d-790b-08303219d9b9.htm
---
# Autodesk.Revit.DB.ToposolidType.GetContourSetting Method

Get the contour setting object from the current toposolid type.

## Syntax (C#)
```csharp
public ContourSetting GetContourSetting()
```

## Returns
The contour setting object.